In [463]:
import pandas as pd
import os.path

In [464]:
BASE_DIR = "/Users/sandrynin/development/projects/Netology/Python/OpenData/names"

In [626]:
def top_names(years_list):
    data = {}
    for year in years_list:
        file = os.path.join(BASE_DIR, 'yob{}.txt'.format(year))
        data[year] = pd.read_csv(file, names=['Name', 'Gender', 'Count'])
    merged = pd.concat(data, names=['Year', 'Pos'])
    merged = merged.groupby(['Name']).sum()
    return merged.sort_values(by='Count', ascending=False).head(3)

In [638]:
res = top_names([1900, 1950, 2000]).reset_index()
res = list(res['Name'])
print(res)

['James', 'John', 'Robert']

In [467]:
def dynamics(year_list):
    female = []
    male = []
    for year in year_list:
        file = os.path.join(BASE_DIR, 'yob{}.txt'.format(year))
        data = pd.read_csv(file, names=['Name', 'Gender', 'Count'])
        male.append(data[data.Gender=='M'].Count.sum())
        female.append(data[data.Gender=='F'].Count.sum())
    return male, female

In [468]:
male, female = dynamics([1900, 1950, 2000])
print('F:', female)
print('M:', male)

F: [299822, 1713450, 1814738]
M: [150490, 1791474, 1962556]

In [469]:
def df_generator(years_list):
    for year in years_list:
        file = os.path.join(BASE_DIR, 'yob{}.txt'.format(year))
        yield pd.read_csv(file, names=['Name', 'Gender', 'Count'])

In [493]:
res = pd.concat(df_generator([1900, 1950, 2000]))
# out = res.pivot_table(['Count'],['Name'], aggfunc='sum', fill_value = 0).sort_values(by='Count', ascending=False).head(3)
res.groupby(['Name']).sum().sort_values(by='Count', ascending=False).head(3)

         Count
Name
James   111822
John    109613
Robert  101396

In [613]:
def merged_count(years_list):
    merged = pd.DataFrame()
    for year in years_list:
        file = os.path.join(BASE_DIR, 'yob{}.txt'.format(year))
        data = pd.read_csv(file, names=['Name', 'Gender', 'Count'])
        if merged.empty:
            merged = data
        else:
            merged = pd.merge(merged, data, on=['Name', 'Gender'])
#             merged.apply(agg_count, axis=1)
    return merged

In [614]:
def agg_count(row):
    print(row)
    row.Count = row.Count_x + row.Count_y
    return row

In [615]:
merged_count([1900, 1950]).head(10)

        Name Gender  Count_x  Count_y
0       Mary      F    16707    65485
1      Helen      F     6343     7060
2       Anna      F     6114     3817
3   Margaret      F     5304    18107
4       Ruth      F     4765     7126
5  Elizabeth      F     4096    14339
6   Florence      F     3920     1446
7      Ethel      F     3896     1603
8      Marie      F     3856     5223
9    Lillian      F     3414     1887